// Напишите программу, которая выводит третью цифру (справа налево) заданного числа или сообщает, что третьей цифры нет.

Console.Write("Введите число " );
int num = int.Parse(Console.ReadLine());

