// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

Console.WriteLine ("Введите числа: ");
int numders = int.Parse(Console.ReadLine());


